from zoneinfo import ZoneInfo

# Настройки Telegram
BOT_TOKEN = "YOUR_BOT_TOKEN"
TIMEZONE = ZoneInfo("Europe/Moscow")

# Настройки локальной нейросети (LM Studio)
LM_STUDIO_URL = "http://localhost:1234/v1"
LM_STUDIO_API_KEY = "lm-studio"
WHISPER_MODEL_NAME = "large-v3-turbo"

# База групп ИКТИБ
GROUPS_DATA = {
    "КТмо1-17": "c95bbc0e-8316-4383-bdcf-433b2edd863c", "КТсо1-3": "27734432-f792-4852-8c55-337d6c6b89eb",
    "КТбо4-2": "7427ba60-f661-4a66-b088-953ce6c6f2e3", "КТмо1-1": "2613160c-2d1d-48ff-a6fe-39f42acf11a7",
    "КТбо4-1": "41eb5606-9d25-4bd7-87a5-6f5482ea5f47", "КТбо2-4": "019f1bf7-27c0-4d3c-9a8d-f816295a17f3",
    "КТмо1-8": "21619ca6-ccc3-4c3e-9b1c-1343e91d6bff", "КТбо1-10": "28c8c20d-c0ef-406d-b18d-85a7712ca95c",
    "КТбо3-7": "eb0424df-4b38-4aad-8154-807919957981", "КТбо3-2": "1cca45c9-84ce-4d04-94df-7c26d87542a9",
    "КТбо3-12": "0e2e3943-7f7c-4aa4-8565-493d9a84932a", "КТбо1-17": "665d01dc-dcdc-4ffc-ba54-85f4419a613b",
    "КТсо3-2": "0f632c6e-e3b1-4b74-8d49-94ffc949a876", "КТмо1-12": "149ce9e9-4ab5-470e-aef6-7dc54edfb8de",
    "КТбо2-6": "a280f7e2-6de7-42c2-8871-77c48f4a2cf4", "КТбо2-11": "16e4fa8a-1eb7-498f-9ef0-8424b8f44851",
    "КТмо2-1": "88bfa099-7591-433e-87cb-c6e90bbb1909", "КТбз2-3": "c7a43615-ba04-4e98-8193-f9feb1ca5a39",
    "КТбо1-18": "fbad2d32-5e93-4675-8849-164a3a2d2cc4", "КТмз3-2": "7e273cc3-164a-42ee-bd67-10bd0d20d9d1",
    "КТмо1-6": "331ecb6e-0a0a-46be-8345-3df450864527", "КТбо4-11": "e085a795-d28c-497e-af82-655c3441fa44",
    "КТбо2-13": "e3534a16-5b1e-4647-bd61-df77370a5fc9", "КТсо5-3": "4b2cad25-d629-4e93-a321-9fb60fb5d3b3",
    "КТмо2-3": "0b7c910d-a767-42c3-bb0a-cab113ca1988", "КТсо4-3": "c76abd4d-1a31-49a8-991c-2eed57fbe0c6",
    "КТбо1-12": "0d3fbe2d-450b-4aa1-baf4-5ac71ea4819c", "КТсо3-5": "e595d8ad-9ced-4a17-abd6-0b400ecec41d",
    "КТсо6-4": "47a75fef-0af7-4fcc-8696-c61fadee1689", "КТсо2-3": "ec0bb7e0-d1c0-4fad-97e0-6adf12733aa9",
    "КТбо2-5": "88a4966b-b0aa-44b5-9f90-4a832f05f4d2", "КТбо4-13": "36e8891a-e961-424e-802a-7811cfcdf7b7",
    "КТбо3-13": "c01759bd-29b9-4c29-b1b9-1520ef7a4823", "КТбо1-7": "a08d5013-627f-4160-8769-041679cdd2ed",
    "КТмо2-15": "75b0094c-be45-4086-a213-4c1cb8781674", "КТбо1-19": "a73c3c49-2c51-4511-944c-50fe80654523",
    "КТмо1-3": "74897953-02c4-4cb5-8912-1889963ced53", "КТбо2-3": "3d35da80-d789-45b3-8d86-915533afc6b5",
    "КТмо2-17": "1a4f89d3-864b-42ac-b636-89b06d8260ae", "КТбо3-15": "bcb5bf1b-fd84-459c-9997-6279ca8e5550",
    "КТбо2-12": "a9764987-589d-4e66-b1be-32f6a27b3e8a", "КТбо3-1": "70e4c4cf-3b32-4003-88c9-a2efd5a5d517",
    "КТбо1-1": "6e043d9b-2f36-49c1-840c-f6fc90f1ce14", "КТмо1-9": "b12b1a38-df78-4682-a272-5cfd186a3d9a",
    "КТсо1-6": "2907b728-fa4f-4420-9e96-4394af85f26e", "КТбо4-7": "85b2f954-c65f-4f6a-8fb0-3de8b50d8a51",
    "КТбз3-3": "bbc45643-b611-42a8-b308-63789532abfa", "КТбо1-2": "041d717c-decb-423a-8bcb-fe7007299dc8",
    "КТао2-5": "68232c23-1d71-40e8-a31b-8711de30f049", "КТмо2-14": "6116cd74-f5b2-4f19-baeb-4d5bdc67e88a",
    "КТбо4-9": "03fe6c13-a2de-4f02-9c44-f0e9cb7c8b4e", "КТмо1-2": "8ee2b05d-7649-4ee9-bdaa-845321ddda85",
    "КТбо3-14": "e0f34246-a486-4f7c-9acc-e844c29ae818", "КТмо1-16": "8fbab0fb-88e1-431f-86c2-bb4aded75876",
    "КТбо1-4": "94c4122e-7a0d-43ae-a29c-df3be351c52a", "КТбо3-4": "dabd3e48-2880-4838-a14a-049af8ee64e7",
    "КТмо2-8": "4cfdbb57-b55d-4ca5-8e1f-065534b84d88", "КТмо1-10": "0945680d-05e6-46b0-8d69-21147312624d",
    "КТбо2-7": "34fe6880-0705-425c-928b-20791980a1db", "КТмо1-5": "1a59a0a4-1126-4219-ad39-09fea390ec14",
    "КТбо3-5": "c48b21ff-b32e-4b68-94aa-bea5fe2115bb", "КТсо5-4": "e48b94b5-81bc-4665-b968-8380d5a2705e",
    "КТбо2-2": "1e03b89e-ce14-4c5b-9eef-5c8954acb72c", "КТсо5-7": "bc78903f-73ce-4ad6-8816-65cd184cc9e5",
    "КТмо2-5": "b58feee0-1e84-4ca1-8896-50330d102dc5", "КТсо2-4": "c8ca3c80-f71b-4566-94ac-2c5454f3bf5c",
    "КТбо1-6": "5d5368c0-b553-4d57-8557-6944fd57a314", "КТбо1-15": "87fd1e54-8062-4beb-980e-48055da66ed9",
    "КТбо3-6": "d65a68a2-bfcf-4484-93f1-69deb3873e6a", "КТмо1-18": "d63f99aa-755b-4f1e-910a-983d268b0adb",
    "КТбо3-11": "e17253fb-106f-4b52-b9f9-5702810e78e9", "КТсо4-1": "0e4a79f7-d56b-4ad3-a2ea-2570a221e094",
    "КТбо4-4": "f94f67e3-3f04-4178-b462-b4ab03e0e787", "КТсо5-6": "bf8b58c1-b452-4190-b940-eb323ea27073",
    "КТсо1-1": "8f213ad1-fe1e-4f2c-b96d-fe3a77865e02", "КТмо2-4": "04a2ef34-82fe-41e4-a508-e9feec87b62b",
    "КТао2-6": "e43eca48-6cf0-4c0e-81e8-e95ebee49bb3", "КТсо4-6": "bcd5219c-95b8-4250-99b1-09e0aa7badd8",
    "КТмо2-13": "ca783d3c-7daf-4ece-aa0d-8ea0a711ba91", "КТбо1-14": "06bac918-8b4e-4495-8ff4-ae170889f7c2",
    "КТсо5-8": "6bade5c6-ce46-40b5-9348-104299449763", "КТмо2-2": "3dd614cd-0d1c-4024-a54f-15079cbaedaf",
    "КТбо1-13": "98ed53b8-1392-4f56-8cdf-d7664ca5dd85", "КТбо4-15": "12ae79d6-ab3d-4780-8084-266f07f8c670",
    "КТбо2-1": "2a337929-cc5e-4f54-9dd3-13150c876f46", "КТмо1-4": "2d51c76f-642c-447c-b6d0-79e509d8b8b1",
    "КТбо1-11": "13df8b6d-2198-40a3-9119-841931821aea", "КТсо4-5": "76942e82-4d86-472f-b4cc-63eb6460afec",
    "КТмо2-16": "7c6d3d65-042e-49a7-9db8-a9282912087d", "КТмо2-7": "652b8245-d275-4b45-a258-8d68602f2696",
    "КТсо3-3": "df66a837-cbdd-44d9-a1f0-4fc39d2c8792", "КТсо1-2": "5fe8503f-c803-40fa-8faf-3de2d48ff230",
    "КТсо6-3": "ac47744c-b2a4-40e8-98cd-762cbdcb1b61", "КТбо2-8": "bb6c888f-ccb1-45da-a7d7-89fb46478afa",
    "КТсо2-6": "cec6781a-5bd6-4f6e-a2a6-72420e53d3ac", "КТсо1-4": "c3debf44-95c3-4749-a32d-747ef3c757f0",
    "КТао2-3": "eb8b6af4-80ba-4b29-9899-8780321d415e", "КТсо2-1": "c7da2202-aca1-4697-a8ba-b9d58e252de1",
    "КТбо3-10": "ecf97332-bd86-4a23-a776-bb4dae224039", "КТсо2-2": "27bf54fc-8ed0-472e-9369-05b293d491d7",
    "КТсо4-8": "d568f7cb-ba2c-4ff9-906d-4dba07f1d003", "КТао1-КТао2-4": "278b0458-dceb-48a7-9caa-071fe2c8fdf3",
    "КТбо1-9": "3e3ccde4-ee61-4e12-8054-4353b77ce3b3", "КТмо1-14": "3585a858-b7cf-4b9a-bcbf-9b27851a3046",
    "КТбо4-8": "5694eb5b-d307-43dc-83a7-58043652faf2", "КТсо3-4": "011dcdd1-28eb-4cdb-b405-03426fad19c5",
    "КТсо5-1": "b464ff35-38ce-4d22-b676-2e077d0247fd", "КТбо4-12": "6dd0babd-bb8a-45e2-b5aa-8d2d0cddb061",
    "КТбо3-3": "5bdd97a1-3487-4abb-91f5-7aababed853e", "КТмо2-10": "885f7e56-6352-4472-9947-cb1bf488bf44",
    "КТбо4-3": "300294eb-49f0-46b8-bd22-21d23e97a90c", "КТао4-8": "1010d6af-29b3-4c6d-a4ee-36c96ec4ddbc",
    "КТбо2-10": "dfdc0279-d864-4d9d-bafa-d5962c0c3009", "КТмо2-11": "2462cba2-e42e-4bd5-b863-717bb9df3a62",
    "КТмо1-13": "f75b677d-5ac4-44b7-9c8a-e027018df90d", "КТмо1-7": "450d55cf-abb9-4677-b4ab-167852068e9e",
    "КТбо3-16": "f0adc902-11f6-4f40-a413-df3c909220a7", "КТмо1-11": "f6b103de-3ada-419c-b19d-2cd16185fce3",
    "КТмо1-15": "87e1b231-7bde-4bcd-9d63-64cbcdec0612", "КТао2-7": "f915d34e-569d-43c7-aaaf-75b735073782",
    "КТсо3-1": "6fa16464-28a7-44f6-8b80-092a2b6b22b4", "КТбо4-14": "cfab19fa-76d3-4f69-8ac6-9a8ff18024ec",
    "КТбо4-5": "00feb590-eb4f-4ba0-9c5f-b436abc62c35", "КТао2-4": "8e2a413d-c110-4b2a-b712-65a2461ebc87",
    "КТсо1-5": "c3bd06b0-921b-4878-b242-3039defebc0c", "КТбо4-16": "95c1f715-fdef-4edf-81dd-ef43ca97f00a",
    "КТмо2-6": "4420ec7d-8724-4208-a4a7-8d7f5bbd42a1", "КТмо2-9": "18c480a1-754b-414d-b07c-77df09d8d3e5"
}

GROUPS_LOWER = {k.lower(): v for k, v in GROUPS_DATA.items()}
